Enterprise_Serivces/Cert/Bronze3/LoyaltyPointsService/result1/Iteration1/t6_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05/ILoyaltyPointsService/SendPointsActivity</wsa:Action><wsa:MessageID>uuid:b8f91ee9-74e4-40a6-8c96-fc7bb6d1a011</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslloyaltyprogramservicesqa1.testgs.pvt/LoyaltyPointsService.svc</wsa:To></soap:Header><soap:Body><SendPointsActivity xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><PointsActivityInfo xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/messages/2011/02"><BasePoints xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/pointtradingpartner/2011/02">1</BasePoints><Channel xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/pointtradingpartner/2011/02"><ChannelID>123456789</ChannelID><Name>ChannelTest</Name></Channel><CustomerId xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/pointtradingpartner/2011/02">1000131178</CustomerId><Description xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/pointtradingpartner/2011/02" /><EventDate xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/pointtradingpartner/2011/02">2016-08-15T15:43:32.553</EventDate><IconImageUrl xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/pointtradingpartner/2011/02" /><PointSubTypeDisplayText xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/pointtradingpartner/2011/02" /><PointSubTypeName xsi:nil="true" xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/pointtradingpartner/2011/02" /><ReferenceGuid xmlns="http://www.gamestop.com/services/csl/shared/contracts/entities/pointtradingpartner/2011/02">4216f9a4-460f-4b22-9489-7a850fff2e7a</ReferenceGuid></PointsActivityInfo></request></SendPointsActivity></soap:Body></soap:Envelope>